SiteSurfaceUtil.projectXYZArrToUVArr(Arr&lt;XYZUtils.XYZ&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Projects an array of XYZs to XY plane, e.g.ignoring the elevation in Site, that is converting an array of XYZs to UVs